document.addEventListener('DOMContentLoaded', function () {
    if (Date.now() != new Date((new Date().getFullYear()) + 1, 0, 17)) {
        document.getElementById("theBody").innerHTML = '<h2 id="restrictionText"; class="noselect" style="position: fixed; margin: 10px; font-weight: bold; width: 100%; text-align: center;font-size: 600%">Access restricted. CLICK THIS TEXT TO G̴̢̯͍͇͔̮̘͕̺̣̘̫͓̳̅̌̃̓̐̉̂̂̄̈̑̽̈͋͆͛́̑͂͊͆̑͊͘͜͝͝͝͠Ȩ̵̡̢̨̡̧̢̢̡̨̨̢̛̦͖͔̪͕͇̦͍͖̱̭͉̰̝͚̥͇͇̭̞̳͔̲̠̝̩̲̟̲̹͔̯̥͚̟̖̞͓͖̦̯͍̯͔͎̲̭̙̝̥̰̝͖̱̘͐̋̎̓̄̎̋̐̂́̅̊̇̒̈́̎̀͛̋͌̿̈́̏͋̈́̽̉̓̓̌̎̀̈́͊̅̄̒̂̄̎̓̎̽̐͐̌̂̂́͂̐͐͑̈́̀̈̔̚̚̚̚̚͘͘͜͠͠͠͝͠͝͝ͅT̸̢̨̧̧̛̛͉̞̻̜̹̦͈̻̩̼̱̞͖͓̻̣͕̤̩̜̥̼̺͉̥̗̺̻̰̗̻̭͇͕̹̻̫͈̥̠̙̖͙̮̣̤͖̥̤̝̭̫̀́̇͛͐̓́́̔́̿̀̈́̄̓̍̈̏̀̆̄̈̃͗̂́̾̅̓̆̈́͋̑̀͌͗̍́͑̀̏̑́̓̈̇͊̈̓̏͐͑͑̒̊͂́̋͘͘͘͜͝͝͝͠͠͝ ̸̧̡̧̧̧̢̛̛̛̛͖̪͙̭͈̼̞͔̦̟̦̖̫͙̼͚̤̪͖͖͎̦̟̤̯̠͙̳̰̣͚̩̰̬͔͈̮̻͇̳̪̜͔̬͎̗̬̗̙̳͔̟̹͕̩͍̌̑̉̈́́̐̈́̍̿̃̆̃̃̈̆̂́̈́̈́̈́̎̎̀̃̊̌̓̓̓̽̂͂̈́̑͗̑͂̾̾̄͑̽̽̂͋͐́́̉̀̈́͐͐̄͗́̿̾͋͒̕͜͝͝͝͠͝͠͠ͅͅƠ̸̡̨̘̪̪̬̲̫͙͎̲͖̤̝̯̙̥̻̜̟̜̮͉̫̎͊̿̊̌̃̎̋̐̈̀͛̌̈́̐͐͐͐͑̈͆͋̀͐̊́̃́̓̂̈́̐̈́̆̄́̌̐̆́̏͑͘̕̚̕͘͝͝ͅŨ̴̳̈́T̶̡̛̛̬̻̠̻͖̖͙̪̻̬͍̬͙̤̱̞̭̦̦͙̯͍̗͈̘͎̰̯͇̯̥̝̳͎̣̖̜̜̟̬͚̝̰̅͗̄̀̇̓̍̀̚͜͝͝ ̵̧̱̳̙̣̫̗̹̳͓̩̜̬̞̼̩̘̝̫̗̻̼̮̗̺̘̥͙͓͎͂̾̓̿͋̇͌́́͂͋̌͗̾̄̍̿͂̀̿̋̍̒͂͌͛͋̋̉͐̈́̀̒̑̀̐̋̓̀̇̕͝͝͝͝ͅǪ̸̨̨̧̨̧̛̪̰̻͙̫̫̠͎̣͕͕̹̱̗̥͖͎̗͓̮͎̟̬̭̖̫̞͇̙̝͓̱͚̪̙̪̼͈͍̻̼̞̩͍̲̹̜͍͇͒̇͆̀̊̓͋̍̑̓͋͊̒̌̄́͌͐͌͌̄͛͐͂͗̀̀͛̑̽̾̋̒͒̃̅̆́̃͒͊̀͌́́́͂̏͂̍̓͘̕̕̕̕͘̚͘͜͝͠͝͝F̴̢̡̫͖̤͔̱̦̞̱̜̳͇̰̺̱̣͈̖̝̲͈͓̦͓̣͖͇̯̲̘͓̹͕͔͈̫̦̹͓̝̥̻̲̝͍̩̳͚̥̤͚̻͇̪͍̜̠̞̜̖͔̥̳̥̲̣̍͑̀͛̿̄͜ͅͅ ̵̡̛̻̙̣̗͖̯̣̺̰͉͓͉͇̬͇͂͗̊̂́͆͌̏̚̚̚͜͠Ḩ̵̧̧̢̛̠͍̳̺̭̻̟͉͔̜̻̳̳̻͍͚̗͉͙̖̼͎͇̳̰̥̭͓̱̟̞̮͊̍̿̿̏̈̊̔͐͐͆̀̏̆́̏͊͂̏̽͌͂̀̌͛͆̈́͗̉̀̈́̀̿̽̾̍̉͛̿̑̅͗̅̊̎͑̆̔̚͘Ë̵̢̡̨̨̢̡̨̛͉̮͇͓͇͎̬̟̗̘̤̣͚̝̲̘̤̞̳͙͍̟̭͉̻͍̩͙͍̬̻̟̹̖̠̭͚̣͙̗͔̙̹̥̳̝̫̮́͒͆̒́͂́̊͑͒̈̌̓̉̊̒̈́͂͐̿̔̆̀̾́̓̓͘̚͠͠͝ͅŖ̴̨̧̡̧̨̧̢̧̨̢̡̢̛̛̛̛͈̻͉̞̤̯̖̞̰̹͇̬̻̲̝̬̰̰̦̼͈̘̳̮͉̜̲̣̱͔̠̱͕̮̝̘̪̺̠͚̼͓̭̤̻͚͕̯̩̩̹̩̺͇̩̜̮̂̂͒̄͑̀̌̊̀̋̃̍͗̍̔́͗́̋̓̓̏̇͒͊̉̒̐̀̐̆̀́̓̅͛̀͆͑̂́̈́̋̄̚̕̚̕͘̚͠͝͠͝͝ͅͅͅͅȨ̸̢̢̨̛̛̘̜͓̹̺͕͔͈̪͇͎͉̯̞̒͊́̒͛̀̑͗̂̽̃̈́̿͑͒̌̊̿̓̒̃̑̑̀̋̀̈́͋̃̀͗̈́̊̈́͆̅̅͂͊̑̌́̂͒͌̆̀͑̐͋̉̒̋͂̓͘͘̕͘̚̚̕̕̚̕͠͝͝͠!̶̨̧̤̜̠͚̹̞̤̖̘̼̥̭͔̲̲̹̪̘̼̜̝͖̳͙̲̲̳̞̑͆͑̕͜ͅ ̷̡̧̨̨̡̧̢̨̖͇̦̭͚̮̖͔̖̠̟̖̗̭̲̜̺̜̫͓̝̜͍͚͔̮̤̻͉̺̜̭͓̣̫̹̗̟̥̳̫̰̮̪̬̞͔̠̱̯̻͈͚̜̭̰̲͇͕̭̤̩̰̞̐̔̀͊̈͌̐͛̉͘͘͜͠ͅŢ̷̡̧̨̢̢̢̛̥̹̖̹̺̬̳̠̮̟̘̟̲̳̪̦̥͕̟̱̟͙̠̰̯̮̺̣̺͙̼͍̹̭͇̥̼͓͙̩̺̣̤̺͎̮̘̼͔͈̝̼̣͉̟̭̩̭͖̞͔̲̜̙́̏̔̿͛͋͐͆̊̏͗̑̍̈͗͑̔̾͐̋̍͆̐̓̾͘͝ͅḨ̷̧̧̨̛̛͚̞͉̮̯͎̠̙̻͈̘̼̯̩̟̆̀͛͊͊̀̆̽̽͗̎͆̌͒̎̓͊͗̃̅̏̊̎̇̈̓̄̎͐̀̔̄͂͛̈́͌̓̒̔̅́́̈́͂͐͋̔̂̄̂̍̕͘͘̕̕͘̚̕͠͠͝͝͠͝͝ͅḮ̸̡̧̧̨̨̢̢̛̛̝͓͚͓̲̬͖̙̪̰̱͔̬̭̠͉̙̝̤͙̳̘̟͎͔̖͕̬̤̖̮͍͚̠̺͈̪̙̝͔̰̦̬͓̝̦͓̖͂̂̓̎͋̀̇͊͂̆͂́͒̈́̈́͒̾͂̌̀͗͐͛́̅̓͑͊̊͘͜͜ͅS̸̢̢̨̡̨̡̡̛̛͎̹̟͚̠͖̻͈͈̘̪̙͔̭̲̳̬̪̹̲̜͍͔͎̯̹̭̦̻̭̖̙͍̙̩̟͉̰̮̆̿̈́͐̿̀̄́̔͆̃̉͐̌̇͋́̑̐̑̒͌͋̿͒̐̾͂͌͛̆́̌̀̽̀͐̇̾̈̀̕ ̷̡̨̡̡̧̢̢̢̱̯̥̗̭͇͇͓̲̬͈̱̦͈̣̣̫̰̗͕̰̟̞͓͈͉̯̯̪̩̭͈̱̯̱̞̤̳͍̖̬̺͙̪͕͈͉̝͖͍̝̜͖̰̺͖̰͍͗̈́̂̆͐̈́̇́̅́̔͐̒̏̎̂̾̂͌͛̒̍̄̍̀͗̌̅͛́̏͋͛̌̂̎̾̇͊͋̋̈́̍͌̂̀̀̀͘͘͠͝͠ͅͅỈ̵̡̧̨̧̢̡̨̢̛͓͕͔̼̹̪͕̠̻̩̝̼̠͖͍͍̙̙͇͖̻̞̤͎̦̼̮͇̗̩̺͙͇̗͎̻͙̗͇̟̺͖̦̮̜̥͚̼̰̜̻̣͖̭̞̙̖̻̘͚̗̔͐͌̃̊̾̒̈́̂̅̄̿͆͒̂̈́͗̿͒̀͐̄͊̿͂̎́͗̅̎̈̽̊̿́̿̋͒̉͂͌̉̔̍̒̾̊̑̏̀́̌̅͐̇̈́͛̈̋̀͑̎͒͊̌͜͜͜͜͜͝͝͝͝͝͝͠͝͠ͅͅS̵̢̢̡̫͖͇̮̘̪͔͚̗̗̝͈̥̣̰̪̜̱̤̦̰͙͓̣̐̈́͂̀̋͒͆̌́̇̈͆͌̎̔̈́͊̃̆̀̿̌͘͜͝͝͝ͅ ̸̨̨̧̡̛̻̜͉̥̲͍̙͇͚͇̳̳͙̯͖̳̜͖͓͇̖̜̠̒͊̓̉̔̽̎̈́͛̍̏͐͋̋̂͋͆̍͛̌͊̆̆̆̓̀͘͜͜͜͝͠͠Ǹ̸̨̛̖̻̬̜̝̝̖̲̫͖̫̻̓̐́̋̆̏͊̓̎̓͑͑͂̏͋̆̏̔̄̊̈́̈́̈́̊̄̈́̈́͊̂̆̎̎̑̋̊̿̓̎̏̈͂̊̂̈̏̽̃̄͂̉̒͋̽́͌̏͋̓̌̄͋̌͒̅̒̅̂͐̍̕̚͠͠͝͠Ǫ̷̛̛̖͎̯̼͙̝͎̙̼̣̰̯̜͚͙̘̭̼͈͖̖͇̯̱̠̅͊̎̉̍̽͋̆͋̽̈́͐̽̈́̅̈́͒̾̈̽̈́̽̔͐̊̑̾̽́̑̐̋̅̅̉̆́͒̿́̋͑̈̎̃͐̊̄͐̋̍͜͝͝͠͝͝T̷̡̞͕͕͙̙̼̻̹̲̣̤͉̼̟͓̈́̈́̃̒̍͒̋͆̌́͛̋̇̿̔̍͆̍͑̓̌͛̎̉͌̃̓̐̆̚̕̚͘͘ ̸̧̨̡̢̛̪̬̬̣̭͙͇̫̗̯̱͍̝͇̜̩̙̙̻͉̬̻̬͓̟̥̻͚̝͈͍̘̮̥͈͖͈̝͖̠̻͎̗͈͔̙̱̮̗̣̬̥̼͋̎̀̆̇̂͗̓̊̓̀́̋̎͒̾̆̽̈̌̽͛̉̐̄̌̍͋͊̓̀̌́̃̓͗͛̈́̑̒̈̏̄̄̈͐̓̊̽̄͒̕̕͘̚̚͜͜͝ͅM̵̧̧̛͈̰̥̬̼͙͇͈̲̞͉̟̹̫͙͈̙̼̦̝͎̟͍̰͔̼͖̥̙͔͕̻̜̹͉͓̤̫̐̊͒̃̂̊̾̈́̎́́̉̽̀̌͛͆̅͑̀̾̽̈̏̓̎͂̋̐̎͊͒́͂̀̓̀̏͊̊̎̈́̏̉̇̈́́̑̐̑͋̂̅̂̀̓̀̐͌̏͛̌̚͘͘͘̕͜͝ͅͅY̵̛̛̛̦̺̯̲̭̬͉̯͍̱͇̩̲͑̒̂̌͐̔͊̌̓̀̈̅̍̃̀͌̂̐̈́̌̄̐͗̎̉͗̂̔̑̓̊̅̃̈́͒͗̾̿̒̊̌̿̈́̿̈́́̂̒̉͛̏̑̈́̎̅͑͊̀͌͛̌͂̐̄̕̚̕͜͝͝ͅ ̷̢̡̢̧̨̢̨̡̨̨͚̱̙̳̲̩̥͈̠̮̘̭̺̲͚̲͈͎͉̘͙̱̘͎͕̣̩͉͉̼̹̲̟͓͉͍͍̲̲̠̳̮͙͇͖̟̙̬̰͖̪͕̮̗͍̠͍͉̦̱̰̒̂̈̽̐͗̓͛͒̍̑̑̂̂͆̈́̿͛̄̽͘͘͘̕͜͜ͅB̵̡̢̡̢̨̢̡̛͇̺̬͓̱̦̹̱̜̞̣͙͎̥̱̞̻̝̰̣͓̬̪͉̱̪͕̞̣͖͓͖͓̦͈̼͖̪̮̰̥̻̮̖̪̫̹̺͚̙͍̭͈̫̼̮̰̤̪̆͗̎͛͒̄̌̈̊̍̄̒̉̋͆̃̓̑̈̈́̍̔̔͛̂̂̒̃̀́͂͌̔̍̒̈́̒̒͛̉́͐̀͗͒̒́̂͐̂̓̈́͒̏̈́̆͌̾̈́͌̐͘̚͜͜͝͝͠͝͠͝͝ͅI̷̡̡̙̜̥̪̭̭̤̱̪̱͙̦͙̥̺̐̽̈̍̃́͑̍̉̽͆͐͒́͒̆̿̔̂̎̊̿̀͋̑̆̆͐̈̆͗̀́́͆̑̿̒̔͒̆̈͊̍́͌̎̄̑́͋̓̆͋͊͗̃̈́́̈́̓̄̐̽̉͌̕͘̕̕̕͘͜͜͝͠͝͝ͅR̵̢̢̡̛̳̲̭̠̠̗̘͇̗͎̣͈͇̠͙̣̹̲͇͍͔͍͔̤̙̝͔͚̗̱͙̬̦̙͖̖̭̥͔̟͈̲̝̘͖̀̈̋̀̉̏̎̅́́͑̓̍̏̅͂̿̍̋̈́͗̈̃̂̈́́̃̾̂͗͂̀̏̅̓̕̕͘͝T̶̨̛̟͙̹͇̖̱̖̺̰̭̱̭̻͈̭͍̰͓̗̝͍̑͂̀̏̋̍̋̅̽̔̄̇̌̓̊́̉͐̈̏́͐̇̎̉̈́̐͑͛̈́̒̒̾͛͗͒͐̓̅͗͝Ḩ̷̹̮͙̫̜̩̟͇͗̊̓̐̽̈͒̂͐̈̊̈͛́͋͑̉̈̇̓͗͂͋̄̐̉̐̀̈́̀̒͗͆̆̓̓̈́̃̏͒͒̏̅̍̀̕̕̚͝͝͝͝͝͝͝Ḑ̸̡̢̧̛̛̗̠̜̥̤̦̜̲͍͇͍̮͕̱̹̼̦̯̪̻̻̦̟͕̘̫̳̞̙̟̳̰̮̗̣̱̺̣̙̱͉̖͉̣̟͛̀̇̓̑̋̇̂͆̂̀̔͐̽̈́̐̃̐̈́̈́͗̿̾́̒̃̓̀͑͑͑͒͊̓̂͗̐́̉̇͋̈́͑̎́̆̄͊̕̚͜͜͝͝A̶̧̡̧̨̨̢̧̧̛͙̟͓̮̟̬͖̻̬̜̩̭̤̲̟̻̩̜͉̩̜̞̥̥͇̼̖̖̱͇̬̘̙̣̟̼̳͎̝̤͕͕̜̦͓̬̰̪͓͍̻͓͚͉̖̤̘̤̰̣͍̟͕͕͉͉͊͂̐̎̃̈̑̓̈̀̿̄͋̈́̊̆̋́͊͑͗́̀̍͋̋̾̀̅̾̊̍̾̀͘͘͘̚̚͜͠͝͠ͅͅY̵̨̛͈͈͈̮̠̥̻̫̞̻̯͚̞̻̙̯̱̼̘͚̖̫̬̮̫̟̦̘̠͔̭̩̻͍̞̮̣͓̯̺̟͎̤͎͙̙̩̤̪̖̺̝̥̥̠̬͓̩̣͎̱͙̥̩͆̽̃̈́̋̂̓̅̂̌͑͒͋͗͌̀̀̾̅̓̅͛̔̿͂͛̉̐͒̿̃̊͐̓͐̉̏̌̎̅̿̑̈̎̆͊̑͂̓̓̚̚͘̕͝͝ ̸̗̽̅̈́̒̈́̋̐̑̃̈́͒̊̋̓̀͊̄̌̽̉̌͑͌̊͋̓̋̏͛͋̀̄͒͂̀͒̂͐̇̔̃͛̑̋̊̆͂̀̑̀͘͝͠͝͝͝͝Y̷̧̛̬̜̫͈̞͚̹̤͇͉͚͕̩̣̩̥̻̤͇̯̯̝̥͔̮͎̥̳̮̼̖̪̌̀́̑̽̆̈̈́̋̌̒͗͂̒͛́̓̐̓̏͌̈́͂̒̐̐͒͌̂́̆͛͛̒̈͗͑̇̏̒͋͛́͛̇̈́̕̚̕͘̚͜͠͝͠͝͠E̶̢̢̧̛̺̟̟̞̼̫̠̣͕͙̻̻̱̟̪̻͔̟̹̪̖̝͕̭͛͛̽͆̊̄̃̆͗̅̽͋͋͛͑͘̚͝Ţ̸̤̝̼̱̙̝̯̼̹̠̫̥͎̜̘̺͖̮̩̠̫̗̘͇͔̘̥́̌͛͛̈͑̄̃̕͘͝͝ͅͅͅ!̵̢̨̭̲͚̞̮͇͖̘͔̱͇̬̯͈̳̪̪̜͇͔̖͙͊͆̍̈̑̓̎͛̄̐̑̀̑̿͗̈́̄̒̇̈̏͒͌̇̿̏͋͋̽̊̄͗̾̒͑̌̈́̈́̃͋̊̓̀̀́̊̄͊͐̐́̌͆̒̔̕͘̕͘͜͝͝͝</h1>';
        document.getElementById("restrictionText").addEventListener('click', () => {
            window.location.href = "index.html";
        });
    }
    const audioPlayer = document.getElementById('audioPlayer');
    const audioSource = document.getElementById('audioSource');
    audioPlayer.volume = 0.25;
    let played = false;
    var mainFiller = document.getElementById('mainFiller');
    document.getElementById('movingBG').style.backgroundImage = "url('./res/bgs/bdaybg.png')";
    const bdayBackButton = document.getElementById('bdayBackButton');
    var curtainsBDAY = document.getElementById('curtainsBDAY');
    randomizeBgColor();
    function randomizeBgColor() {
        mainFiller.style.backgroundColor = "rgba(" + Math.random() * 255 + ", " + Math.random() * 255 + ", 0.75)";
        mainFiller.style.opacity = "0.75";
        setTimeout(() => {
            randomizeBgColor();
        }, 1000);
    }
    curtainsBDAY.addEventListener('click', () => {
        if (!played) {
            curtainsBDAY.classList.add('curtainLift');
            const path = './res/audio/bday.mp3';

            audioSource.src = path;
            audioPlayer.load();
            audioPlayer.play();
            played = true;
        }
    });
    document.getElementById('header2bday').click();


    // Event listener for the toggle button
    bdayBackButton.addEventListener('click', () => {
        window.location.href = "index.html";
    });
});
